<template>
  <div class="">
    <div class="mobile-layout">
      <div class="notification-header">
        <div class="necessities">
          <i class="fas fa-signal"></i>
          <i class="fas fa-wifi"></i>
          <i class="fas fa-battery-full"></i>
        </div>
      </div>
      <div class="actions">
        <i class="fas fa-chevron-left"></i>
        <i class="fas fa-bookmark"></i>
      </div>
      <Crumb />
      <!-- <div class="book-cover" id="book-cover-id">
        <div class="book-top">{{ bookTitle }}</div>
        <img
          id="book-side-bottom"
          class="book-side"
          src="https://raw.githubusercontent.com/atomic-variable/images-repo/e37f432405904a280858e5437ce1960753bc78a3/book-side.svg"
          alt="book-side"
        />
      </div> -->
      <div class="preface" id="preface-id">
        <div class="content">
          <div class="header">
            <div class="title">{{ bookTitle }}</div>
            <div class="icon">
              <i class="fas fa-chevron-down"></i>
            </div>
          </div>
          <!-- <div class="author">by Anne Frank</div> -->
          <div class="body">
            1 00:00:00,800 --> 00:00:01,640 神秘复苏 2 00:00:01,640 -->
            00:00:03,880 各种畸形神明从城市下方出现 3 00:00:03,880 -->
            00:00:05,660 一切的生物都将发生一变 4 00:00:05,680 --> 00:00:07,880
            90%的人口将成为丧坑 5 00:00:07,880 --> 00:00:10,020
            剩下的人则会拥有特殊的能力 6 00:00:10,640 --> 00:00:11,800 没变治愈
            7 00:00:11,800 --> 00:00:12,600 预知未来 8 00:00:12,600 -->
            00:00:15,040 这些只存在于二次元的东西都将降临 9 00:00:15,040 -->
            00:00:16,560 从此人间化为炼狱 10 00:00:16,560 --> 00:00:18,800
            而我重生在末世降临的两天半前 11 00:00:18,800 --> 00:00:21,400
            并觉醒了SSS及双翼能天犬与主宰 12 00:00:21,400 --> 00:00:22,920
            不仅能够奴役神和凶兽 13 00:00:22,920 --> 00:00:25,280
            更能掌控所有金属成为万磁王 14 00:00:25,280 --> 00:00:28,580
            上一世失去的这一世我都要夺回来嗯 15 00:00:29,800 --> 00:00:31,600
            2049年4月3日 16 00:00:31,600 --> 00:00:34,100
            想不到我竟然回到了天灾来的两天半前 17 00:00:34,120 --> 00:00:36,480
            上一世天灾一变后我被妖姬救了下来 18 00:00:36,480 --> 00:00:39,360
            最后却惨遭战区高层子四妇炎劫的迫害 19 00:00:39,360 --> 00:00:42,260
            强行被派遣去讨伐SSS及任务的纪念生 20 00:00:43,920 --> 00:00:46,080
            亲眼见到妖姬惨死到自己面前 21 00:00:46,080 --> 00:00:48,200
            而对方却因为背景不凡的原因 22 00:00:48,200 --> 00:00:50,860
            仅仅是关押了两个半月就被放了出来 23 00:00:50,960 --> 00:00:53,340
            傅延杰这一事我必要你加倍奉还 24 00:00:54,720 --> 00:00:55,800
            我不仅重生了 25 00:00:55,800 --> 00:00:57,660
            难道连异能都发生了改变吗 26 00:00:57,720 --> 00:01:00,240
            上一世我仅仅是b级异能精神干扰 27 00:01:00,240 --> 00:01:01,900
            希望这一世别太差就行 28 00:01:02,080 --> 00:01:03,860 天海市市中心
            29 00:01:03,960 --> 00:01:07,100
            小白耳旁忽然想起一阵阵扑通扑通的沉闷声 30 00:01:07,120 -->
            00:01:08,240 像是心脏在跳动 31 00:01:08,240 --> 00:01:09,800
            令人心神躁动不安 32 00:01:09,800 --> 00:01:11,680
            看来说起神就在这下面了 33 00:01:11,680 --> 00:01:13,720
            随后小白来到了一个大型超市 34 00:01:13,720 --> 00:01:15,400
            一口气买了大量的物资 35 00:01:15,400 --> 00:01:17,320
            这家伙不会是来逃荒的吧 36 00:01:17,320 --> 00:01:20,020
            先生您确定要购买这么多东西吗 37 00:01:20,120 --> 00:01:22,560
            结账吧你这里能够直接送货上门吗 38 00:01:22,560 --> 00:01:23,680
            当然可以的 39 00:01:23,680 --> 00:01:25,560
            这些东西短时间是够小白用了 40 00:01:25,560 --> 00:01:28,080
            但小白现在还有个更重要的事情要去处理 41 00:01:28,080 -->
            00:01:29,880 那就是找到上一世吞噬的兽企 42 00:01:29,880 -->
            00:01:30,520 什么业主 43 00:01:30,520 --> 00:01:31,980 代号46的穷企
            44 00:01:32,200 --> 00:01:33,520 如果我没有记错的话 45 00:01:33,520
            --> 00:01:36,980 穷奇第一次的出现时间就是在天星苑小区之中 46
            00:01:37,000 --> 00:01:39,600 天星苑小区内猫猫那么可爱 47
            00:01:39,600 --> 00:01:41,520 你们怎么忍心要把它们安乐死 48
            00:01:41,520 --> 00:01:43,440 你们的良心难道不会痛吗 49 00:01:43,440
            --> 00:01:45,880 这些猫已经出现了好几喜挠人事件了 50 00:01:45,880
            --> 00:01:46,840 你看我的手 51 00:01:46,840 --> 00:01:49,620
            将这些猫安乐死也是区业主们一致同意的 52 00:01:49,680 -->
            00:01:51,360 毛毛只不过是扇了你的手 53 00:01:51,360 --> 00:01:52,840
            而你是想要他们的命 54 00:01:52,840 --> 00:01:53,940 这能一样吗 55
            00:01:53,960 --> 00:01:56,240 好了瑶瑶你也别太生气了 56 00:01:56,240
            --> 00:01:58,720 这群人是不会明白生命的可贵的 57 00:01:58,720 -->
            00:01:59,720 我出5万 58 00:01:59,720 --> 00:02:01,420
            你们将这些猫给我吧 59 00:02:01,560 --> 00:02:04,360
            没想到李绍不仅有钱还那么有爱心 60 00:02:04,360 --> 00:02:05,940
            好想给他生猴子啊 61 00:02:06,240 --> 00:02:07,140 麻烦让一让 62
            00:02:07,720 --> 00:02:09,020 小白你怎么来了 63 00:02:09,080 -->
            00:02:11,240 眼前这个女人是小白的前女友路遥 64 00:02:11,240 -->
            00:02:11,960 大学期间 65 00:02:11,960 --> 00:02:14,160
            无父无母的小白一直打工供他读书 66 00:02:14,160 --> 00:02:16,160
            不料他刚毕业就光速甩了小白 67 00:02:16,160 --> 00:02:19,120
            并把自己打包成外卖送到了富哥的床上 68 00:02:19,120 --> 00:02:21,000
            小白你不要纠缠我了 69 00:02:21,000 --> 00:02:22,360 我们不可能了 70
            00:02:22,360 --> 00:02:23,860 这只胖猫我要了 71 00:02:26,080 -->
            00:02:28,240 小白你他喵给老子赞助 72 00:02:28,240 --> 00:02:30,160
            这些野猫都被本少买下了 73 00:02:30,160 --> 00:02:31,880
            你若是感动本少的东西 74 00:02:31,880 --> 00:02:34,180
            本少便会让你见不到明天的太阳 75 00:02:36,280 --> 00:02:37,860
            小白你疯了吧 76 00:02:37,920 --> 00:02:40,500
            饶饶命你该庆幸现在还不是末世 77 00:02:40,520 --> 00:02:42,300
            否则你已经是个死人了 78 00:02:42,480 --> 00:02:44,560
            随后小白来到了一处家具厂 79 00:02:44,560 --> 00:02:46,000
            订购了一批铁门铁窗 80 00:02:46,000 --> 00:02:47,560 用于前期抵抗一种
            81 00:02:47,560 --> 00:02:50,040 小伙子你正是准备打造一个堡垒啊 82
            00:02:50,040 --> 00:02:51,620 将家里搞得这么严实 83 00:02:51,680 -->
            00:02:53,080 最近小区贼比较多 84 00:02:53,080 --> 00:02:54,500
            搞严实点才放心 85 00:02:54,520 --> 00:02:55,720 那你可找对人了 86
            00:02:55,720 --> 00:02:57,120 我们门窗质量杠杠的 87 00:02:57,120 -->
            00:02:58,340 价格还便宜 88 00:02:58,360 --> 00:02:59,440
            我这边比较急 89 00:02:59,440 --> 00:03:00,280 今天就要 90
            00:03:00,280 --> 00:03:01,760 外形上没有什么要求 91 00:03:01,760 -->
            00:03:03,100 质量过关便可以 92 00:03:04,200 --> 00:03:05,440
            你这里有铁笼吗 93 00:03:05,440 --> 00:03:06,280 铁笼没有 94
            00:03:06,280 --> 00:03:07,920 不过倒是有一些废铁杆 95 00:03:07,920
            --> 00:03:10,140 用工具切割焊接一下就好了 96 00:03:10,200 -->
            00:03:12,940 购置完这些物品后小白便返回了出租屋 97 00:03:14,200 -->
            00:03:15,380 你给我老实点 98 00:03:17,560 --> 00:03:20,020
            这些东西差不多也够吃个两个半月了 99 00:03:20,720 --> 00:03:21,880
            这是快觉醒了吗 100 00:03:21,880 --> 00:03:23,840
            可千万要在末世到来前觉醒啊 101 00:03:23,840 --> 00:03:27,580
            因为异能者初次觉醒异能的时候正是最为虚弱的时刻 102 00:03:28,800 -->
            00:03:30,320 您好是白先生吗 103 00:03:30,320 --> 00:03:33,260
            你订购的门窗到了麻烦您下来签收一下 104 00:03:34,800 --> 00:03:36,960
            白先生需要我帮您送上去吗 105 00:03:36,960 --> 00:03:39,080
            不用了我自己来就可以了 106 00:03:39,080 --> 00:03:40,740
            你一个人真的可以吗 107 00:03:42,160 --> 00:03:43,900 我去这是超人吗
            108 00:03:46,240 --> 00:03:47,740 啊真香哎 109 00:03:48,240 -->
            00:03:50,360 建国叔再来一份鸭腿饭 110 00:03:50,360 --> 00:03:53,280
            看着桌前光速炫完一大碗鸭腿饭的小白 111 00:03:53,280 --> 00:03:54,720
            刘建国人都傻了 112 00:03:54,720 --> 00:03:55,920 建国叔干啥呢 113
            00:03:55,920 --> 00:03:57,380 还怕我吃霸王餐啊 114 00:03:57,520 -->
            00:03:59,980 小白啊你今天咋这么能吃 115 00:04:00,040 -->
            00:04:01,160 建国叔是个好人 116 00:04:01,160 --> 00:04:04,320
            之前小白打工养前女友时生活比较拮据 117 00:04:04,320 --> 00:04:07,200
            建国叔每次都会给他免费加上一碗鸭腿饭 118 00:04:07,200 -->
            00:04:10,200 是不是又因为那个女娃子你没钱吃饭了 119 00:04:10,200 -->
            00:04:13,060 我都说了那女娃不是什么好人 120 00:04:13,200 -->
            00:04:15,300 不是就是有点想你了 121 00:04:15,480 --> 00:04:19,200
            你小子怎么神经兮兮的像变了个人似的 122 00:04:19,200 --> 00:04:20,400
            我还是那个小白 123 00:04:20,400 --> 00:04:24,400
            建国说如果我是说如果这个世界末日降临了 124 00:04:24,400 -->
            00:04:25,420 你会怎么做 125 00:04:25,440 --> 00:04:26,800
            你这也没发哨啊 126 00:04:26,800 --> 00:04:28,600 难道是科幻片看多了
            127 00:04:28,600 --> 00:04:29,480 来就来了 128 00:04:29,480 -->
            00:04:31,560 我唯一担心的就是我家的女儿 129 00:04:31,560 -->
            00:04:33,020 她没事就行了 130 00:04:33,080 --> 00:04:35,280
            建国书如果你愿意相信我的话 131 00:04:35,280 --> 00:04:38,720
            5号前你和家里人带好大量的物资去原新家具厂呆着 132 00:04:38,720 -->
            00:04:39,900 哪里都不要去 133 00:04:39,920 --> 00:04:43,840
            原新家具厂正是小白今天早上所购置铁门铁窗的地方 134 00:04:43,840 -->
            00:04:46,000 那里人少而且较为偏僻封闭 135 00:04:46,000 -->
            00:04:48,500 日后将会有大量的幸存者聚集在那里 136 00:04:48,560 -->
            00:04:50,380 建国书你要保重 137 00:04:51,680 --> 00:04:52,720
            回到出租屋后 138 00:04:52,720 --> 00:04:54,580 小白感觉浑身燥热难耐
            139 00:04:54,640 --> 00:04:55,840 我这是要觉醒了吗 140 00:04:55,840
            --> 00:04:57,220 希望这次不会太久 141 00:04:57,280 --> 00:05:00,760
            随后小白身躯之上竟然浮现出一层层的紫色涟漪 142 00:05:00,760 -->
            00:05:03,040 像是在不断冲刷洗涤着他的身躯一般 143 00:05:03,040 -->
            00:05:05,360 周围的铁门与铁窗嗡嗡颤动了起来 144 00:05:05,360 -->
            00:05:08,100 整个老旧的楼房都显得有些摇摇欲坠 145 00:05:08,120 -->
            00:05:12,140 第二天神灵精主宰嗯 146 00:05:12,280 --> 00:05:14,920
            这一次我觉醒的竟然不是精神系的异能 147 00:05:14,920 --> 00:05:16,120
            而是神灵系异能 148 00:05:16,120 --> 00:05:17,060 精之主宰 149
            00:05:17,120 --> 00:05:19,220 异能者分为四类精神系 150 00:05:19,280
            --> 00:05:23,780 元素系普通系以及最为神秘强大可以比肩神明的神灵系
            151 00:05:27,320 --> 00:05:29,600 好强这就是神灵系的力量吗 152
            00:05:29,600 --> 00:05:30,760 明天12点钟 153 00:05:30,760 -->
            00:05:32,700 这个世界的一切都将被颠覆 154 00:05:32,760 -->
            00:05:35,340 傅延杰好好享受你最后的欢愉吧 155 00:05:35,400 -->
            00:05:36,160 这么说来 156 00:05:36,160 --> 00:05:37,640
            另一个异能并未觉醒 157 00:05:37,640 --> 00:05:40,200
            两个异能都觉醒的话物资就不太够用了 158 00:05:40,200 --> 00:05:41,680
            可现在自己已经没钱了 159 00:05:41,680 --> 00:05:43,380
            看来还得想点其他办法 160 00:05:44,280 --> 00:05:45,560
            你也要觉醒了吗 161 00:05:45,560 --> 00:05:47,520
            老实点再养你一段时间 162 00:05:47,520 --> 00:05:48,760
            若还是养不熟的话 163 00:05:48,760 --> 00:05:50,080 就算你是穷奇 164
            00:05:50,080 --> 00:05:51,540 老子也把你炖了 165 00:05:51,800 -->
            00:05:53,860 随后小白来到了一个破旧的街道 166 00:05:55,080 -->
            00:05:58,220 什么人我来买点玩具进来吧 167 00:05:58,240 -->
            00:06:00,840 看你这样子可不像是我们圈子的人 168 00:06:00,840 -->
            00:06:02,800 你是怎么知道这个地方的 169 00:06:02,800 -->
            00:06:05,480 白狼前世专门干一些见不得光的买卖 170 00:06:05,480 -->
            00:06:06,960 不过末世后自立为王 171 00:06:06,960 --> 00:06:08,380
            建立了不小的势力 172 00:06:08,400 --> 00:06:10,360
            怎么白狮子也会以貌取人了呀 173 00:06:10,360 --> 00:06:12,040
            嗯闻言白狼眼眸威咪 174 00:06:12,040 --> 00:06:15,200
            白狮子这个外号只有非常熟悉自己的人才知道 175 00:06:15,200 -->
            00:06:17,240 好小子你说的对 176 00:06:17,240 --> 00:06:18,520
            想买些什么 177 00:06:18,520 --> 00:06:19,880 只要你的钱代购 178
            00:06:19,880 --> 00:06:22,180 就算是这玩意我也有一些 179
            00:06:22,320 --> 00:06:24,240 说吧想要什么 180 00:06:24,240 -->
            00:06:28,440 要钱你想要的这个东西有点贵啊说 181 00:06:28,440 -->
            00:06:29,880 是谁派你来的 182 00:06:29,880 --> 00:06:30,840
            没有人派我来 183 00:06:30,840 --> 00:06:32,560 我只是单纯的要钱而已
            184 00:06:32,560 --> 00:06:35,380 既然知道我的名号你还敢来 185
            00:06:38,400 --> 00:06:41,180 子弹居然停下来了这怎么可能 186
            00:06:41,320 --> 00:06:43,540 何必呢我仅仅是为了钱而已 187
            00:06:44,760 --> 00:06:48,680
            你他喵是人还是鬼你你你你要多少钱我都给你 188 00:06:48,680 -->
            00:06:49,980 请绕我一命 189 00:06:50,040 --> 00:06:51,280
            早这样不就好了 190 00:06:51,280 --> 00:06:52,280 我只要10万 191
            00:06:52,280 --> 00:06:53,480 我勒个去啊 192 00:06:53,480 -->
            00:06:54,920 我虽然家产不多 193 00:06:54,920 --> 00:06:56,800
            一个小目标还是有的 194 00:06:56,800 --> 00:07:00,660
            你一个连枪都不怕的人竟然张口就只要10万 195 00:07:00,680 -->
            00:07:03,060 过去了这个倒不错 196 00:07:03,200 --> 00:07:04,920
            前辈您喜欢就拿去 197 00:07:04,920 --> 00:07:06,380 统统可以拿去 198
            00:07:06,400 --> 00:07:07,680 这钱我也不白要 199 00:07:07,680 -->
            00:07:08,640 给你个忠道 200 00:07:08,640 --> 00:07:11,200
            明天中午12点之前准备好大量的物资 201 00:07:11,200 --> 00:07:12,120
            越多越好 202 00:07:12,120 --> 00:07:14,320 然后待在这哪都不要去啊
            203 00:07:14,320 --> 00:07:16,680 为什么到时候你就知道了 204
            00:07:16,680 --> 00:07:19,200 那个前辈大师您收我为徒吧 205
            00:07:19,200 --> 00:07:20,980 多少钱我都愿意付 206 00:07:22,640 -->
            00:07:25,460 老子就不相信这等地高手会骗我 207 00:07:25,720 -->
            00:07:28,560 狼哥今天你咋有空给我打电话呢 208 00:07:28,560 -->
            00:07:33,820 江东派手下的弟兄们去超市给我把能吃能用的东西都搬空 209
            00:07:33,960 --> 00:07:36,100 狼哥你这是要抢超市啊 210 00:07:36,120
            --> 00:07:37,160 去你丫的 211 00:07:37,160 --> 00:07:39,440
            谁要抢了用钱去给我买 212 00:07:39,440 --> 00:07:41,720
            我给你转了3,000万用滴吃的 213 00:07:41,720 --> 00:07:43,240
            能买多少买多少 214 00:07:43,240 --> 00:07:45,160 不够了再给我打电话
            215 00:07:45,160 --> 00:07:48,340 在明天中午12点之前都送到我这来 216
            00:07:48,400 --> 00:07:49,640 就凭这一次了 217 00:07:49,640 -->
            00:07:51,920 这样的高手必然是知道了什么 218 00:07:51,920 -->
            00:07:54,620 难道还会骗我一个普通人不成 219 00:07:54,720 -->
            00:07:57,340 随后小白又购买了大量的食物以及水 220 00:07:57,360 -->
            00:07:59,480 小白之所以没有大量囤积物资 221 00:07:59,480 -->
            00:08:01,860 是因为他本就不打算在这天海市九游 222 00:08:01,880 -->
            00:08:06,220 他计划将两个异能平安进阶到二街之后便准备出发去华北市
            223 00:08:06,280 --> 00:08:07,980 你是不是能够听懂我说话 224
            00:08:08,600 --> 00:08:11,300 都说动物能够比人类提前预知到危险的到来
            225 00:08:11,320 --> 00:08:13,380 我想你应该也察觉到了什么吧 226
            00:08:14,040 --> 00:08:17,760
            想不想从笼子里出来以后跟着我我就是你老大 227 00:08:17,760 -->
            00:08:18,920 我就放你出来 228 00:08:18,920 --> 00:08:20,740
            不同意明天你就会嘎 229 00:08:23,440 --> 00:08:24,320 你放心吧 230
            00:08:24,320 --> 00:08:26,980 这一世跟着我我会让你重拾穷奇之名
          </div>
        </div>
      </div>
    </div>
  </div>

  <!--
https://saranyamk.github.io/images-repo/book-top.svg
https://saranyamk.github.io/images-repo/book-side.svg
--></template>

<script>
import Crumb from "@/components/common/crumb/Crumb.vue";

export default {
  components: {
    Crumb,
  },
  data() {
    return {
      bookTitle: "Toàn cầu băng phong",
    };
  },
  setup() {
    return {};
  },
  methods: {
    scrollRotate() {
      let image = document.getElementById("book-cover-id");
      image.style.transform =
        "rotateX(" +
        Math.min(Math.min(window.pageYOffset / 2, 20), 22) +
        "deg)" +
        "translateZ(3px) scale(0.75)";
      let text = document.getElementById("preface-id");
      text.style.transform =
        "translateY(" + Math.max(-window.pageYOffset, -302) + "px)";
    },
  },
};
</script>

<style lang="scss" scoped>
$mobile-width: 325px;
$mobile-height: 670px;
$mobile-radius: 0.559rem;
$separator-height: 500px;

$mobile-bg: #292929;
$font-color: #fff;

$transition: transform 0.7s ease-in-out;

.info {
  font-family: "Quicksand", sans-serif;
  font-style: italic;
  font-size: 26px;
  margin-top: 10px;
  color: $font-color;
}

.mobile-layout {
  // width: $mobile-width;
  // height: $mobile-height;
  // margin: 30px 0;
  border-radius: $mobile-radius;
  perspective: 500px;
  overflow: hidden;
  color: $font-color;
  background-color: $mobile-bg;
  // box-shadow: 36px 36px 50px 15px rgba(238, 215, 209, 0.82);

  .notification-header,
  .actions {
    position: fixed;
    top: 5px;
    width: 100%;
    padding: 5px 15px;
    display: flex;
    justify-content: space-between;
    font-size: 12px;
    font-family: "Open Sans", sans-serif;
    font-weight: bold;
    z-index: 6;
  }

  .actions {
    top: 37px;
    padding: 50px;
    font-size: 20px;
  }

  .book-cover {
    position: relative;
    height: $separator-height;
    // width: calc(#{$mobile-width} * 2);
    border-top-left-radius: $mobile-radius;
    border-top-right-radius: $mobile-radius;
    transform-style: preserve-3d;
    transform-origin: 50% 40%;
    transition: $transition;
    z-index: 4;
  }

  .book-top {
    width: 15rem;
    position: absolute;
    left: 0;
    right: 0;
    top: 0;
    bottom: 0;
    margin: auto;
    z-index: 5;
    transform: translateZ(28.5px);
    background-color: #857070;
    height: 251px;
    border-radius: 5px 10px 10px 5px;
    color: white;
    display: flex;
    justify-content: center;
    align-items: center;
  }
  #book-side-bottom {
    // min-width: 19.8rem;
  }
  .book-side {
    width: 19.8rem;
    position: absolute;
    top: 289px;
    left: 0;
    right: 0;
    bottom: 0;
    margin: auto;
    transform: translateY(-40px) translateX(0px) translateZ(15px) rotateX(34deg);
  }

  .preface {
    height: 100%;
    padding: 50px;
    transition: $transition;

    .header {
      display: flex;
      align-items: center;
    }

    .title {
      font-family: "Quicksand", sans-serif;
      font-size: 26px;
      margin-bottom: 10px;
    }

    .author {
      font-family: "Open Sans", sans-serif;
      font-style: italic;
      margin-bottom: 20px;
    }

    .icon {
      transform-origin: top;
      transition: $transition;
    }

    .body {
      font-family: "Quicksand", sans-serif;
      text-align: left;
    }

    .body p:first-child {
      margin-bottom: 15px;
    }
  }
}
</style>
